IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_G1_EPWM16_CONTROLSS_G1_EPWM16.xml
	<register id="CONTROLSS_G1_EPWM16_XCMP1_ACTIVE" acronym="CONTROLSS_G1_EPWM16_XCMP1_ACTIVE" offset="0x600" width="32" description="Additional Compare 1 Active Register">
		<bitfield id="XCMP1_ACTIVE" width="16" begin="31" end="16" resetval="0x0" description="XCMP1_ACTIVE Register The value in the XCMP1_ACTIVE register is loaded into CMPA/B [shadow/active] registers when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XCMP1HR_ACTIVE" width="16" begin="15" end="0" resetval="0x0" description="XCMP1HR_ACTIVE Register  The value in the XCMP1HR_ACTIVE register is loaded into CMPA/BHR [shadow/active] registers when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G1_EPWM16_XCMP2_ACTIVE" acronym="CONTROLSS_G1_EPWM16_XCMP2_ACTIVE" offset="0x604" width="32" description="Additional Compare 2 Active Register">
		<bitfield id="XCMP2_ACTIVE" width="16" begin="31" end="16" resetval="0x0" description="XCMP2_ACTIVE Register The value in the XCMP2_ACTIVE register is loaded into CMPA/B [shadow/active] registers when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XCMP2HR_ACTIVE" width="16" begin="15" end="0" resetval="0x0" description="XCMP2HR_ACTIVE Register  The value in the XCMP2HR_ACTIVE register is loaded into CMPA/BHR [shadow/active] registers when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G1_EPWM16_XCMP3_ACTIVE" acronym="CONTROLSS_G1_EPWM16_XCMP3_ACTIVE" offset="0x608" width="32" description="Additional Compare 3 Active Register">
		<bitfield id="XCMP3_ACTIVE" width="16" begin="31" end="16" resetval="0x0" description="XCMP3_ACTIVE Register The value in the XCMP3_ACTIVE register is loaded into CMPA/B [shadow/active] registers when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XCMP3HR_ACTIVE" width="16" begin="15" end="0" resetval="0x0" description="XCMP3HR_ACTIVE Register  The value in the XCMP3HR_ACTIVE register is loaded into CMPA/BHR [shadow/active] registers when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G1_EPWM16_XCMP4_ACTIVE" acronym="CONTROLSS_G1_EPWM16_XCMP4_ACTIVE" offset="0x60C" width="32" description="Additional Compare 4 Active Register">
		<bitfield id="XCMP4_ACTIVE" width="16" begin="31" end="16" resetval="0x0" description="XCMP4_ACTIVE Register The value in the XCMP4_ACTIVE register is loaded into CMPA/B [shadow/active] registers when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XCMP4HR_ACTIVE" width="16" begin="15" end="0" resetval="0x0" description="XCMP4HR_ACTIVE Register  The value in the XCMP4HR_ACTIVE register is loaded into CMPA/BHR [shadow/active] registers when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G1_EPWM16_XCMP5_ACTIVE" acronym="CONTROLSS_G1_EPWM16_XCMP5_ACTIVE" offset="0x610" width="32" description="Additional Compare 5 Active Register">
		<bitfield id="XCMP5_ACTIVE" width="16" begin="31" end="16" resetval="0x0" description="XCMP5_ACTIVE Register The value in the XCMP5_ACTIVE register is loaded into CMPA/B [shadow/active] registers when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XCMP5HR_ACTIVE" width="16" begin="15" end="0" resetval="0x0" description="XCMP5HR_ACTIVE Register  The value in the XCMP5HR_ACTIVE register is loaded into CMPA/BHR [shadow/active] registers when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G1_EPWM16_XCMP6_ACTIVE" acronym="CONTROLSS_G1_EPWM16_XCMP6_ACTIVE" offset="0x614" width="32" description="Additional Compare 6 Active Register">
		<bitfield id="XCMP6_ACTIVE" width="16" begin="31" end="16" resetval="0x0" description="XCMP6_ACTIVE Register The value in the XCMP6_ACTIVE register is loaded into CMPA/B [shadow/active] registers when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XCMP6HR_ACTIVE" width="16" begin="15" end="0" resetval="0x0" description="XCMP6HR_ACTIVE Register  The value in the XCMP6HR_ACTIVE register is loaded into CMPA/BHR [shadow/active] registers when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G1_EPWM16_XCMP7_ACTIVE" acronym="CONTROLSS_G1_EPWM16_XCMP7_ACTIVE" offset="0x618" width="32" description="Additional Compare 7 Active Register">
		<bitfield id="XCMP7_ACTIVE" width="16" begin="31" end="16" resetval="0x0" description="XCMP7_ACTIVE Register The value in the XCMP7_ACTIVE register is loaded into CMPA/B [shadow/active] registers when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XCMP7HR_ACTIVE" width="16" begin="15" end="0" resetval="0x0" description="XCMP7HR_ACTIVE Register  The value in the XCMP7HR_ACTIVE register is loaded into CMPA/BHR [shadow/active] registers when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G1_EPWM16_XCMP8_ACTIVE" acronym="CONTROLSS_G1_EPWM16_XCMP8_ACTIVE" offset="0x61C" width="32" description="Additional Compare 8 Active Register">
		<bitfield id="XCMP8_ACTIVE" width="16" begin="31" end="16" resetval="0x0" description="XCMP8_ACTIVE Register The value in the XCMP8_ACTIVE register is loaded into CMPA/B [shadow/active] registers when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XCMP8HR_ACTIVE" width="16" begin="15" end="0" resetval="0x0" description="XCMP8HR_ACTIVE Register  The value in the XCMP8HR_ACTIVE register is loaded into CMPA/BHR [shadow/active] registers when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G1_EPWM16_XTBPRD_ACTIVE" acronym="CONTROLSS_G1_EPWM16_XTBPRD_ACTIVE" offset="0x620" width="32" description="Additional Time Base Period Active Register">
		<bitfield id="XTBPRD_ACTIVE" width="16" begin="31" end="16" resetval="0x0" description="The value in the XTBPRD_ACTIVE register is loaded into TBPRD [shadow/active] registers when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XTBPRDHR_ACTIVE" width="16" begin="15" end="0" resetval="0x0" description="The value in the XTBPRDHR_ACTIVE register is loaded into TBPRDHR [shadow/active] registers when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
